Catalogs/ЭлементыКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементыКонструктораВидовПродукцииИС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыКонструктораВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает текущие элементы конструктора видов продукции ИС.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС - элемент конструктора.
//   * Значение - Структура из КлючИЗначение:
//      ** Ключ1     - Строка - Параметризуется.
//      ** Значение1 - Булево - Истина, если параметризуется.
//      ** Ключ2     - Строка - ВидыПродукции.
//      ** Значение2 - Соответствие из КлючИЗначение:
//          *** Ключ     - СправочникСсылка.ВидыПродукцииИС - вид продукции.
//          *** Значение - Соответствие из КлючИЗначение - значения:
//               **** Ключ     - ОпределяемыйТип.ЗначениеЭлементаКонструктораВидовПродукцииИС - значение,
//                               Строка - имя ключа атрибутов, если не Параметризуется и ИспользоватьАтрибуты.
//               **** Значение - Структура - из КлючИЗначение - имена и значения атрибутов:
//                     ***** Ключ     - Строка - имя атрибута.
//                     ***** Значение - Произвольный - значение атрибута.
//
Функция ЭлементыКонструктора() Экспорт
	
	Результат = Новый Соответствие;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Подсистемы = Новый Массив;
	Для Каждого Суффикс Из КонструкторИСОбщегоНазначенияКлиентСервер.СуффиксыВидовПродукции() Цикл
		Если ОбщегоНазначенияИС.ПодсистемаИспользуется(Суффикс) Тогда
			Подсистемы.Добавить(
				Справочники.ЭлементыКонструктораВидовПродукцииИС["ВидыПродукции"+Суффикс]);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЭлементовКонструктора = ПараметрыЭлементовКонструктора();
	ЭлементыПоВсемВидамПродукции = ЭлементыПоВсемВидамПродукции(ПараметрыЭлементовКонструктора);
	
	Если Подсистемы.Количество() > 0
		Или ЭлементыПоВсемВидамПродукции.Количество() > 0 Тогда
		
		КлючАтрибутовВидаПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.КлючАтрибутовВидаПродукции();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подсистемы", Подсистемы);
		Запрос.УстановитьПараметр("ЭлементыПоВсемВидамПродукции", ЭлементыПоВсемВидамПродукции);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции
		|ПОМЕСТИТЬ ДоступныеВидыПродукции
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|ГДЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора В (&Подсистемы)
		|	И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора В (&Подсистемы)
		|	И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияЭлементовКонструктора.Значение КАК Значение
		|ПОМЕСТИТЬ ЗначенияЭлементовКонструктора
		|ИЗ
		|	ДоступныеВидыПродукции КАК ДоступныеВидыПродукции
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|		ПО ДоступныеВидыПродукции.ВидПродукции = ЗначенияЭлементовКонструктора.ВидПродукции
		|ГДЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора.Предопределенный
		|	И НЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора.ЭтоГруппа
		|	И НЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора В (&ЭлементыПоВсемВидамПродукции)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияПользователяЭлементовКонструктора.Значение КАК Значение,
		|	ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ЗначенияПользователяЭлементовКонструктора
		|ИЗ
		|	ДоступныеВидыПродукции КАК ДоступныеВидыПродукции
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|		ПО ДоступныеВидыПродукции.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора.Предопределенный
		|	И НЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора.ЭтоГруппа
		|	И НЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора В (&ЭлементыПоВсемВидамПродукции)
		|;
		|ВЫБРАТЬ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияЭлементовКонструктора.Значение КАК Значение
		|ПОМЕСТИТЬ ЗначенияЭлементовКонструктораПоВсемВП
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|ГДЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора.Предопределенный
		|	И НЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора.ЭтоГруппа
		|	И ЗначенияЭлементовКонструктора.ЭлементКонструктора В (&ЭлементыПоВсемВидамПродукции)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияПользователяЭлементовКонструктора.Значение КАК Значение,
		|	ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ЗначенияПользователяЭлементовКонструктораПоВсемВП
		|ИЗ
		|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора.Предопределенный
		|	И НЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора.ЭтоГруппа
		|	И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора В (&ЭлементыПоВсемВидамПродукции)
		|;
		|ВЫБРАТЬ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияЭлементовКонструктора.Значение КАК Значение,
		|	ЛОЖЬ КАК ЭтоЗначениеПользователя,
		|	ЗначенияАтрибутов.Атрибуты КАК Атрибуты
		|ИЗ
		|	ЗначенияЭлементовКонструктора КАК ЗначенияЭлементовКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПользователяЭлементовКонструктора КАК ЗначенияПользователяЭлементовКонструктора
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|		И ЗначенияЭлементовКонструктора.Значение = ЗначенияПользователяЭлементовКонструктора.Значение
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияАтрибутов
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияАтрибутов.ЭлементКонструктора
		|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияАтрибутов.ВидПродукции
		|		И ЗначенияЭлементовКонструктора.Значение = ЗначенияАтрибутов.Значение
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияПользователяЭлементовКонструктора.Значение КАК Значение,
		|	ИСТИНА КАК ЭтоЗначениеПользователя,
		|	ЗначенияАтрибутов.Атрибуты КАК Атрибуты
		|ИЗ
		|	ЗначенияПользователяЭлементовКонструктора КАК ЗначенияПользователяЭлементовКонструктора
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияАтрибутов
		|		ПО ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗначенияАтрибутов.ЭлементКонструктора
		|		И ЗначенияПользователяЭлементовКонструктора.ВидПродукции = ЗначенияАтрибутов.ВидПродукции
		|		И ЗначенияПользователяЭлементовКонструктора.Значение = ЗначенияАтрибутов.Значение
		|ГДЕ
		|	НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлементыКонструктора.Ссылка КАК ЭлементКонструктора,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка) КАК ВидПродукции,
		|	НЕОПРЕДЕЛЕНО КАК Значение,
		|	ЛОЖЬ КАК ЭтоЗначениеПользователя,
		|	НЕОПРЕДЕЛЕНО КАК Атрибуты
		|ИЗ
		|	Справочник.ЭлементыКонструктораВидовПродукцииИС КАК ЭлементыКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияЭлементовКонструктора КАК ЗначенияЭлементовКонструктора
		|	ПО ЭлементыКонструктора.Ссылка = ЗначенияЭлементовКонструктора.ЭлементКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПользователяЭлементовКонструктора КАК ЗначенияПользователяЭлементовКонструктора
		|	ПО ЭлементыКонструктора.Ссылка = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|ГДЕ
		|	ЭлементыКонструктора.Предопределенный
		|	И НЕ ЭлементыКонструктора.ЭтоГруппа
		|	И ЗначенияЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|	И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|	И НЕ ЭлементыКонструктора.Ссылка В (&ЭлементыПоВсемВидамПродукции)
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияЭлементовКонструктора.Значение КАК Значение,
		|	ЛОЖЬ КАК ЭтоЗначениеПользователя,
		|	ЗначенияАтрибутов.Атрибуты КАК Атрибуты
		|ИЗ
		|	ЗначенияЭлементовКонструктораПоВсемВП КАК ЗначенияЭлементовКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПользователяЭлементовКонструктораПоВсемВП КАК ЗначенияПользователяЭлементовКонструктора
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|		И ЗначенияЭлементовКонструктора.Значение = ЗначенияПользователяЭлементовКонструктора.Значение
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияАтрибутов
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияАтрибутов.ЭлементКонструктора
		|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияАтрибутов.ВидПродукции
		|		И ЗначенияЭлементовКонструктора.Значение = ЗначенияАтрибутов.Значение
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияПользователяЭлементовКонструктора.Значение КАК Значение,
		|	ИСТИНА КАК ЭтоЗначениеПользователя,
		|	ЗначенияАтрибутов.Атрибуты КАК Атрибуты
		|ИЗ
		|	ЗначенияПользователяЭлементовКонструктораПоВсемВП КАК ЗначенияПользователяЭлементовКонструктора
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияАтрибутов
		|		ПО ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗначенияАтрибутов.ЭлементКонструктора
		|		И ЗначенияПользователяЭлементовКонструктора.ВидПродукции = ЗначенияАтрибутов.ВидПродукции
		|		И ЗначенияПользователяЭлементовКонструктора.Значение = ЗначенияАтрибутов.Значение
		|ГДЕ
		|	НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлементыКонструктора.Ссылка КАК ЭлементКонструктора,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка) КАК ВидПродукции,
		|	НЕОПРЕДЕЛЕНО КАК Значение,
		|	ЛОЖЬ КАК ЭтоЗначениеПользователя,
		|	НЕОПРЕДЕЛЕНО КАК Атрибуты
		|ИЗ
		|	Справочник.ЭлементыКонструктораВидовПродукцииИС КАК ЭлементыКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияЭлементовКонструктораПоВсемВП КАК ЗначенияЭлементовКонструктора
		|	ПО ЭлементыКонструктора.Ссылка = ЗначенияЭлементовКонструктора.ЭлементКонструктора
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПользователяЭлементовКонструктораПоВсемВП КАК ЗначенияПользователяЭлементовКонструктора
		|	ПО ЭлементыКонструктора.Ссылка = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|ГДЕ
		|	ЭлементыКонструктора.Предопределенный
		|	И НЕ ЭлементыКонструктора.ЭтоГруппа
		|	И ЗначенияЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|	И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|	И ЭлементыКонструктора.Ссылка В (&ЭлементыПоВсемВидамПродукции)
		|	
		|ИТОГИ ПО
		|	ЭлементКонструктора,
		|	ВидПродукции";
		
		ВыборкаЭлементКонструктора = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЭлементКонструктора.Следующий() Цикл
			Параметры = ПараметрыЭлементовКонструктора[ВыборкаЭлементКонструктора.ЭлементКонструктора];
			Если Параметры = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВидыПродукции = Новый Соответствие;
			
			ВыборкаВидПродукции = ВыборкаЭлементКонструктора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидПродукции.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ВыборкаВидПродукции.ВидПродукции) Тогда
					Продолжить;
				КонецЕсли;
				Выборка = ВыборкаВидПродукции.Выбрать();
				Значения = Новый Соответствие;
				ЗначениеПользователя = Неопределено;
				Пока Выборка.Следующий() Цикл
					Атрибуты = Новый Структура;
					Если Параметры.Параметризуется Тогда
						Если Выборка.Значение = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						Значение = Выборка.Значение;
					ИначеЕсли Параметры.ИспользоватьАтрибуты Тогда
						Значение = КлючАтрибутовВидаПродукции;
					Иначе
						Продолжить;
					КонецЕсли;
					Если Параметры.ИспользоватьАтрибуты Тогда
						Если Выборка.Атрибуты <> Неопределено Тогда
							АтрибутыЭлемента = Выборка.Атрибуты.Получить();
							Если ТипЗнч(АтрибутыЭлемента) = Тип("Структура") Тогда
								Атрибуты = АтрибутыЭлемента;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Значения.Вставить(Значение, Атрибуты);
					Если Параметры.КаждомуВидуПродукцииСоответствуетОдноЗначение
						И Выборка.ЭтоЗначениеПользователя Тогда
						ЗначениеПользователя = Значение;
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеПользователя <> Неопределено
					И Значения.Количество() > 1 Тогда
					Атрибуты = Значения[ЗначениеПользователя];
					Значения.Очистить();
					Значения.Вставить(ЗначениеПользователя, Атрибуты);
				КонецЕсли;
				ВидыПродукции.Вставить(ВыборкаВидПродукции.ВидПродукции, Значения);
			КонецЦикла;
			ДанныеЭлемента = Новый Структура;
			ДанныеЭлемента.Вставить("Параметризуется", Параметры.Параметризуется);
			ДанныеЭлемента.Вставить("ВидыПродукции", ВидыПродукции);
			Результат.Вставить(ВыборкаЭлементКонструктора.ЭлементКонструктора, ДанныеЭлемента);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Получает предопределенные параметры элементов конструктора.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС - элемент конструктора.
//   * Значение - см. НачальныеПараметрыЭлементаКонструктора.
//
Функция ПараметрыЭлементовКонструктора() Экспорт
	
	Результат = Новый Соответствие;
	
	СтандартныеЭлементы = Новый Массив;
	СтандартныеЭлементы.Добавить(ВидыПродукцииГИСМТ); // Флаг ПоВсемВидамПродукции не включен, так как флаг назначен элементу ТоварныеГруппыГИСМТ
	СтандартныеЭлементы.Добавить(ВидыПродукцииМОТП);
	СтандартныеЭлементы.Добавить(ВидыПродукцииМЕХ);
	СтандартныеЭлементы.Добавить(ВидыПродукцииВетИС);
	СтандартныеЭлементы.Добавить(ВидыПродукцииСАТУРН);
	СтандартныеЭлементы.Добавить(ВидыПродукцииЗЕРНО);
	СтандартныеЭлементы.Добавить(ВидыПродукцииЕГАИС);
	СтандартныеЭлементы.Добавить(ПроверкаВозраста);
	СтандартныеЭлементы.Добавить(МаркируемыеВидыПродукцииЕГАИС);
	СтандартныеЭлементы.Добавить(ПолеМРЦ);
	СтандартныеЭлементы.Добавить(МаркировкаОстатков);
	СтандартныеЭлементы.Добавить(Перемаркировка);
	СтандартныеЭлементы.Добавить(ЗаказКодовДляПриемаТоваровНаКомиссиюОтФизическихЛиц);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотТоваровПолученныхОтФизическихЛиц);
	СтандартныеЭлементы.Добавить(ОперацияОтчетОбОтбраковкеЧерезСУЗ);
	СтандартныеЭлементы.Добавить(ПредставлениеВидаПродукцииВоМножественномЧисле);
	СтандартныеЭлементы.Добавить(ПолеСвидетельствоОГосударственнойРегистрации);
	СтандартныеЭлементы.Добавить(ЗапросСтатусовЕАЭС);
	СтандартныеЭлементы.Добавить(КодыФИАС);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеКодовФИАС);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотПроизводствоРФ);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотПроизводствоРФПоДоговору);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотТрансграничнаяТорговля);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотИмпортСФТС);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотИмпортСФТСМех);
	СтандартныеЭлементы.Добавить(ОперацияИндивидуализацияКИЗ);
	СтандартныеЭлементы.Добавить(ОперацияОтгрузкаЕАЭССПризнаниемКИ);
	СтандартныеЭлементы.Добавить(ОперацияОтгрузкаВЕАЭСПриОСУ);
	СтандартныеЭлементы.Добавить(ОперацияОтгрузкаПродажа);
	СтандартныеЭлементы.Добавить(ОперацияОтгрузкаКомиссия);
	СтандартныеЭлементы.Добавить(ОперацияОтгрузкаАгент);
	СтандартныеЭлементы.Добавить(ОперацияПодтверждениеПоступленияКИЗ);
	СтандартныеЭлементы.Добавить(ОперацияВводВОборотПроизводствоВнеЕАЭС);
	СтандартныеЭлементы.Добавить(СписаниеЧерезГИСМТОбщийДокумент);
	СтандартныеЭлементы.Добавить(СписаниеЧерезГИСМТ);
	СтандартныеЭлементы.Добавить(СписаниеЧерезСУЗ);
	СтандартныеЭлементы.Добавить(СписаниеЧерезСУЗМех);
	СтандартныеЭлементы.Добавить(УведомлениеОбОтгрузкеНаЭкспорт);
	СтандартныеЭлементы.Добавить(ПолеИдентификаторПроизводственногоЗаказа);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковПолноеОписание);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковУпрощенноеОписание);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковМодель);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковНаименование);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковСпособВводаВОборот);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковТоварныйЗнак);
	СтандартныеЭлементы.Добавить(МаркировкаОстатковЦелевойПол);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляСпособВводаВОборот);
	СтандартныеЭлементы.Добавить(ОперацияОтчетОНанесенииКодовМаркировки);
	СтандартныеЭлементы.Добавить(СераяЗона);
	СтандартныеЭлементы.Добавить(SSCC18);
	СтандартныеЭлементы.Добавить(SSCC20);
	СтандартныеЭлементы.Добавить(АТК);
	СтандартныеЭлементы.Добавить(ПолеОСУ);
	СтандартныеЭлементы.Добавить(ВОтчетеОНанесенииИспользоватьОбъем);
	СтандартныеЭлементы.Добавить(ВОтчетеОНанесенииИспользоватьВес);
	СтандартныеЭлементы.Добавить(ВОтчетеОНанесенииПередаватьИНН);
	СтандартныеЭлементы.Добавить(ВОтчетеОНанесенииПередаватьКПП);
	СтандартныеЭлементы.Добавить(ПриВводеВОборотПередаватьКПП);
	СтандартныеЭлементы.Добавить(ПолеСервисПровайдер);
	СтандартныеЭлементы.Добавить(ВЗапросеСтатусовКИИспользоватьТоварнуюГруппу);
	СтандартныеЭлементы.Добавить(ВЗапросеВложенныхКИИспользоватьТоварнуюГруппу);
	СтандартныеЭлементы.Добавить(ПолеТипОплатыКодовМаркировки);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляСпособФормированияСерийныхНомеров);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляДоговорСОператором);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляСпособПолучения);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляВидКИЗ);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляРазмерКИЗ);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляСпособВводаВОборотВТабличнойЧасти);
	СтандартныеЭлементы.Добавить(ПроверятьЗаполнениеПоляКодТНВЭДВТабличнойЧасти);
	СтандартныеЭлементы.Добавить(ПолеСтранаПроизводства);
	СтандартныеЭлементы.Добавить(ПолеЦвет);
	СтандартныеЭлементы.Добавить(ПолеРазмер);
	СтандартныеЭлементы.Добавить(КорректировкаСведенийКМ);
	СтандартныеЭлементы.Добавить(КорректировкаСведенийКМСрокГодностиВСД);
	СтандартныеЭлементы.Добавить(КорректировкаСведенийКМСрокГодности);
	СтандартныеЭлементы.Добавить(КорректировкаСведенийКМФактическийВес);
	СтандартныеЭлементы.Добавить(ПолеЗаменитьСведенияОДокументахСертификации);
	СтандартныеЭлементы.Добавить(ПолеТоварныйЗнак);
	СтандартныеЭлементы.Добавить(ПолеИдентификаторПроизводственнойПлощадкиВЕТИС);
	СтандартныеЭлементы.Добавить(ПеременноеКоличествоМернойПродукции);
	СтандартныеЭлементы.Добавить(ПоддерживаетсяФорматаОбменаСУЗНижеV3);
	СтандартныеЭлементы.Добавить(ТребуетсяПодписаниеЗаказаНаЭмиссиюСУЗНижеV3);
	СтандартныеЭлементы.Добавить(ПередаватьСпособИзготовленияКодовМаркировкиВСУЗ);
	СтандартныеЭлементы.Добавить(ПолеСертификатСоответствия);
	СтандартныеЭлементы.Добавить(ПолеДекларацияСоответствия);
	СтандартныеЭлементы.Добавить(ПолеВетеринарныйСертификат);
	СтандартныеЭлементы.Добавить(ПоддерживаетсяПодключениеКОборудованиюРозлива);
	СтандартныеЭлементы.Добавить(КодМаркировкиВключаетНулевойМРЦ);
	СтандартныеЭлементы.Добавить(КодМаркировкиМожетВключатьВес);
	СтандартныеЭлементы.Добавить(КодМаркировкиМожетВключатьОбъем);
	СтандартныеЭлементы.Добавить(КодМаркировкиМожетВключатьЗаводскойСерийныйНомер);
	СтандартныеЭлементы.Добавить(НастройкаПредставлений);
	СтандартныеЭлементы.Добавить(РазрешеноПревышениеЕмкостиУпаковкиПриЧастичномВыбытии);
	СтандартныеЭлементы.Добавить(ПриемкаТоваров);
	СтандартныеЭлементы.Добавить(ВозвратВОборот);
	СтандартныеЭлементы.Добавить(КонтролироватьСоставГрупповойУпаковки);
	СтандартныеЭлементы.Добавить(ИспользоватьЧислительИЗнаменательПриЧастичномВыбытииНаККТ);
	СтандартныеЭлементы.Добавить(ПолеКоличествоУпаковкаЦелоеЧисло);
	СтандартныеЭлементы.Добавить(ПолеКоличествоФиксированныйВесПодсказка);
	СтандартныеЭлементы.Добавить(БлокировкаКодовМаркировки);
	СтандартныеЭлементы.Добавить(ОперацияЗагрузкаСведенийОбОтклонениях);
	СтандартныеЭлементы.Добавить(ОперацияЗагрузкаСпискаКИНаБалансе);
	СтандартныеЭлементы.Добавить(ПричинаВыводаИзОборотаТрансграничнаяПродажаВСтраныЕАЭС);
	СтандартныеЭлементы.Добавить(СинонимыВидовПродукции);
	СтандартныеЭлементы.Добавить(ДоступноСписаниеВложенныхЭлементов);
	СтандартныеЭлементы.Добавить(ПеремещениеМеждуМОД);
	СтандартныеЭлементы.Добавить(РазрешениеНаОтгрузку);
	СтандартныеЭлементы.Добавить(ФорматКодаЛогистическойУпаковкиGS1_128);
	СтандартныеЭлементы.Добавить(ФорматКодаЛогистическойУпаковкиASC_MH_10);
	СтандартныеЭлементы.Добавить(ФорматКодаЛогистическойУпаковкиПроизвольный);
	СтандартныеЭлементы.Добавить(КонтролироватьЕМЦ);
	СтандартныеЭлементы.Добавить(КонтролироватьПеремещениеМеждуМОД);
	СтандартныеЭлементы.Добавить(ВУПДПередаватьКодФИАСОтправителя);
	СтандартныеЭлементы.Добавить(ВУПДПередаватьКодФИАСПолучателя);
	СтандартныеЭлементы.Добавить(ВУПДПередаватьПеревозочныеДокументы);
	СтандартныеЭлементы.Добавить(ПолеМинимальнаяРозничнаяЦена);
	СтандартныеЭлементы.Добавить(АгрегироватьНаборыКакЛогистическиеУпаковки);
	СтандартныеЭлементы.Добавить(ДоступнаРегистрацияМОДВГИСМТ);
	СтандартныеЭлементы.Добавить(Сырье);
	СтандартныеЭлементы.Добавить(ВводВОборотСырьяОстатки);
	СтандартныеЭлементы.Добавить(ВводВОборотСырьяПроизводствоРФ);
	СтандартныеЭлементы.Добавить(ВводВОборотСырьяПолучениеТовараВнеЕАЭС);
	СтандартныеЭлементы.Добавить(ВводВОборотСырьяПолучениеТовараИзЕАЭС);
	
	ДобавитьСтандартныеЭлементы(Результат, СтандартныеЭлементы);
	
	Результат[ВидыПродукцииМОТП].ПоВсемВидамПродукции             = Истина;
	Результат[ВидыПродукцииМЕХ].ПоВсемВидамПродукции              = Истина;
	Результат[ВидыПродукцииВетИС].ПоВсемВидамПродукции            = Истина;
	Результат[ВидыПродукцииСАТУРН].ПоВсемВидамПродукции           = Истина;
	Результат[ВидыПродукцииЗЕРНО].ПоВсемВидамПродукции            = Истина;
	Результат[ВидыПродукцииЕГАИС].ПоВсемВидамПродукции            = Истина;
	Результат[МаркируемыеВидыПродукцииЕГАИС].ПоВсемВидамПродукции = Истина;
	Результат[СинонимыВидовПродукции].ПоВсемВидамПродукции        = Истина;
	
	Результат[ВидыПродукцииГИСМТ].ИзменяетсяВИнтерфейсеПользователя = Истина;
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ТоварныеГруппыГИСМТ,
		Тип("СправочникСсылка.ТоварныеГруппыГИСМТ"));
	Результат[ТоварныеГруппыГИСМТ].ПоВсемВидамПродукции = Истина;
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ЗависимыеВидыПродукцииИС,
		Тип("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	Результат[ЗависимыеВидыПродукцииИС].ПоВсемВидамПродукции = Истина;
	Результат[ЗависимыеВидыПродукцииИС].ИспользоватьАтрибуты = Истина;
	Результат[ЗависимыеВидыПродукцииИС].Атрибуты.Вставить(
		"Обязательный", Новый ОписаниеТипов("Булево"));
	Результат[ЗависимыеВидыПродукцииИС].Атрибуты.Вставить(
		"Значение", Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, КоличествоЗнаковТНВЭДДляПередачиГИСМТ,
		ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Результат[КоличествоЗнаковТНВЭДДляПередачиГИСМТ].КаждомуВидуПродукцииСоответствуетОдноЗначение = Истина;
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, СрокИспользованияНеОплаченныхЭмитированныхКодовМаркировки,
		ОбщегоНазначения.ОписаниеТипаЧисло(3));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ТипыМаркировкиККТПоВидамПродукции,
		Тип("ПеречислениеСсылка.ТипыМаркировкиККТ"));
	Результат[ТипыМаркировкиККТПоВидамПродукции].КаждомуВидуПродукцииСоответствуетОдноЗначение = Истина;

	//
	ДатыНачалаОформления = Новый Массив;
	ДатыНачалаОформления.Добавить(ДатыНачалаОформленияУПДОСУ);
	ДатыНачалаОформления.Добавить(ДатыНачалаОформленияУПДПоштучно);
	ДатыНачалаОформления.Добавить(ДатыНачалаРозничныхПродаж);
	ДатыНачалаОформления.Добавить(ДатыНачалаРазрешительногоРежима);
	ДатыНачалаОформления.Добавить(ДатыНачалаИспользованияЛокальногоМодуля);
	ДатыНачалаОформления.Добавить(ДатыНачалаПроизводства);
	ДатыНачалаОформления.Добавить(ДатыНачалаВыводаИзОборота);
	ДатыНачалаОформления.Добавить(ДатыНачалаЗапретаПродажБезМарок);
	ДатыНачалаОформления.Добавить(ДатыНачалаПрослеживаемостиПеремещенияМеждуМОД);
	ДатыНачалаОформления.Добавить(ДатыНачалаКонтроляРазрешительныхДокументов);
	
	ДобавитьДаты(Результат, ДатыНачалаОформления);
	
	Для Каждого Элемент Из ДатыНачалаОформления Цикл
		Результат[Элемент].ИзменяетсяВИнтерфейсеПользователя = Истина;
		Результат[Элемент].ПоВсемВидамПродукции              = Истина;
	КонецЦикла;
	
	//
	Результат[НастройкаПредставлений].ИспользоватьАтрибуты = Истина;
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"Родительный", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"Винительный", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПредставлениеВидПродукции", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ЧастичноеВыбытиеПоштучно", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ИсключениеПродажаПоштучно", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ШаблонЧислительных", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантИспользованияЕдиницы", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ЕмкостьПотребительскойУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"НоменклатураТекстПодвала", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"НоменклатураТекстПодвалаЧастичноеВыбытие", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"НоменклатураТекущаяПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"НастроеннаяНоменклатураПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПодсказкаНоменклатураБезДокументовСборкаРазборка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПодсказкаНоменклатураОдинДокументСборкаРазборка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПодсказкаНоменклатураМногоДокументовСборкаРазборка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ЗаголовокГруппыУпаковка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ЗаголовокГруппыШтука", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоЧастичноеВыбытиеЗаголовок", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоЧастичноеВыбытиеПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоКоробЗаголовок", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоКоробПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоУпаковкаЗаголовок", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПолеКоличествоУпаковкаПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыПотребительскаяПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыКоробБлокПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыЧастьУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыЧастьУпаковкиПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыКоробБлокПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыЧастьУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ВариантЕдиницыЧастьУпаковкиПодсказка", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПредставлениеЕдиницыЧастичногоВыбытия", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПродажаЧастичноеВыбытиеИменительный", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПродажаЧастичноеВыбытиеРодительный", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Результат[НастройкаПредставлений].Атрибуты.Вставить(
		"ПродажаЧастичноеВыбытиеВинительный", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	//
	Результат[СинонимыВидовПродукции].ИспользоватьАтрибуты = Истина;
	Результат[СинонимыВидовПродукции].Атрибуты.Вставить(
		"Синоним", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ИмяПараметраГоденДо,
		Тип("Строка"));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ВзаимноеПризнаниеКодовМаркировки,
		Тип("Строка"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(ПолеВариантВыполненияАгрегации);
	ПараметризуемыеЭлементы.Добавить(ПолеТНВЭД);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляКодТНВЭД);
	ПараметризуемыеЭлементы.Добавить(ПолеGTIN);
	ПараметризуемыеЭлементы.Добавить(ПолеПредставлениеGTINОстатки);
	ПараметризуемыеЭлементы.Добавить(ПроверятьСоставУпаковокПоДаннымИСМП);
	ПараметризуемыеЭлементы.Добавить(ПолеВидМеха);
	ПараметризуемыеЭлементы.Добавить(ПолеЛицензияНаПользованиеНедрами);
	ПараметризуемыеЭлементы.Добавить(ПолеСертификация);
	ПараметризуемыеЭлементы.Добавить(ПолеНомерСкважины);
	ПараметризуемыеЭлементы.Добавить(ПолеПаспортСоответствия);
	ПараметризуемыеЭлементы.Добавить(ПолеНомерПартии);
	ПараметризуемыеЭлементы.Добавить(ПолеНомерСерии);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляНомерСерии);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСертификация);
	ПараметризуемыеЭлементы.Добавить(ПолеСумма);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСумма);
	ПараметризуемыеЭлементы.Добавить(ПолеСуммаАкциза);
	ПараметризуемыеЭлементы.Добавить(ПолеТаможеннаяДекларация);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляТаможеннаяДекларация);
	ПараметризуемыеЭлементы.Добавить(ПолеПринятоеРешениеКодТаможенногоОргана);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляПринятоеРешениеКодТаможенногоОргана);
	ПараметризуемыеЭлементы.Добавить(ПолеСтавкаНДС);
	ПараметризуемыеЭлементы.Добавить(ПолеОтчетПроизводственнойЛинии);
	ПараметризуемыеЭлементы.Добавить(ПолеПроизводственнаяПлощадкаВЕТИС);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСтранаПроисхождения);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляДатаИмпорта);
	ПараметризуемыеЭлементы.Добавить(ДатаПроизводства);
	ПараметризуемыеЭлементы.Добавить(ДатаПроизводстваВСУЗСУказаниемЧасовогоПояса);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляДатаПроизводства);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеНоменклатурыЕслиGTINНе029);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеНоменклатурыЕслиНеЗаполненGTIN);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляКонтрагент);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСуммаАкциза);
	ПараметризуемыеЭлементы.Добавить(СрокГодности);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСрокГодности);
	ПараметризуемыеЭлементы.Добавить(СкоропортящаясяПродукция);
	ПараметризуемыеЭлементы.Добавить(ПолеЗаводскойСерийныйНомерВнутриКМ);
	ПараметризуемыеЭлементы.Добавить(ПолеGLNКонтрагента);
	ПараметризуемыеЭлементы.Добавить(ПолеИдентификаторПроисхождения);
	ПараметризуемыеЭлементы.Добавить(ПолеПроизводитель);
	ПараметризуемыеЭлементы.Добавить(ПолеДанныеИмпорта);
	ПараметризуемыеЭлементы.Добавить(ПолеОтгрузкаНеучастнику);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляGLNКонтрагента);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляИдентификаторПроисхожденияВЕТИС);
	ПараметризуемыеЭлементы.Добавить(ПолеПричинаСписанияВТабличнойЧасти);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляПричинаСписанияВТабличнойЧасти);
	ПараметризуемыеЭлементы.Добавить(КонтролироватьВладельцевКодовМаркировки);
	ПараметризуемыеЭлементы.Добавить(КонтролироватьСтатусыКодовМаркировки);
	ПараметризуемыеЭлементы.Добавить(ИгнорироватьРезультатыПроверкиКодовМаркировкиНаККТ);
	ПараметризуемыеЭлементы.Добавить(ИмяРеквизитаКодМаркировки);
	ПараметризуемыеЭлементы.Добавить(ИмяОперацииГИСМТ);
	ПараметризуемыеЭлементы.Добавить(ИмяПоляСортировки);
	ПараметризуемыеЭлементы.Добавить(ПолеСодержаниеЭтиловогоСпирта);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляСодержаниеЭтиловогоСпирта);
	ПараметризуемыеЭлементы.Добавить(ПолеПервичныйДокументВТабличнойЧасти);
	ПараметризуемыеЭлементы.Добавить(ПолеGLNОрганизации);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляGLNОрганизации);
	ПараметризуемыеЭлементы.Добавить(ПроверятьЗаполнениеПоляПервичныйДокументВТабличнойЧасти);
	ПараметризуемыеЭлементы.Добавить(ПоддерживаетсяОСУ);
	ПараметризуемыеЭлементы.Добавить(ПриВводеВОборотПередаватьИдентификаторМОД);
	ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
	
	//
	ТипЭлементКонструктора = Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС");
	
	Результат[КонтролироватьСтатусыКодовМаркировки].ИспользоватьАтрибуты = Истина;
	Результат[КонтролироватьСтатусыКодовМаркировки].Атрибуты.Вставить("СвязанныйЭлемент", ТипЭлементКонструктора);
	Результат[КонтролироватьСтатусыКодовМаркировки].Атрибуты.Вставить("ВыключенДоДатыДействияСвязанногоЭлемента", Новый ОписаниеТипов("Булево"));
	Результат[КонтролироватьВладельцевКодовМаркировки].ИспользоватьАтрибуты = Истина;
	Результат[КонтролироватьВладельцевКодовМаркировки].Атрибуты.Вставить("СвязанныйЭлемент", ТипЭлементКонструктора);
	Результат[КонтролироватьВладельцевКодовМаркировки].Атрибуты.Вставить("ВключенДоДатыДействияСвязанногоЭлемента", Новый ОписаниеТипов("Булево"));
	
	Результат[КонтролироватьСтатусыКодовМаркировки].ИзменяетсяВИнтерфейсеПользователя               = Истина;
	Результат[КонтролироватьВладельцевКодовМаркировки].ИзменяетсяВИнтерфейсеПользователя            = Истина;
	Результат[ИгнорироватьРезультатыПроверкиКодовМаркировкиНаККТ].ИзменяетсяВИнтерфейсеПользователя = Истина;
	
	Результат[МаркировкаОстатков].ИспользоватьАтрибуты = Истина;
	Результат[МаркировкаОстатков].Атрибуты.Вставить(
		"ДатаНачала", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат[МаркировкаОстатков].Атрибуты.Вставить(
		"ДатаОкончания", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Результат[ИмяРеквизитаКодМаркировки].ИспользоватьАтрибуты = Истина;
	Результат[ИмяРеквизитаКодМаркировки].Атрибуты.Вставить(
		"ИмяРеквизита", ОбщегоНазначения.ОписаниеТипаСтрока(10));

	Результат[ИмяОперацииГИСМТ].ИспользоватьАтрибуты = Истина;
	Результат[ИмяОперацииГИСМТ].Атрибуты.Вставить(
		"ИмяОперации", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	Результат[ИмяПоляСортировки].ИспользоватьАтрибуты = Истина;
	Результат[ИмяПоляСортировки].Атрибуты.Вставить(
		"ИмяПоля", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ПереходныеВидыПродукции,
		Тип("СправочникСсылка.ВидыПродукцииИС"));

	//
	ДобавитьПараметризуемыеЭлементы(Результат, МаркировкаОстатковВозрастнаяКатегория,
		ОбщегоНазначения.ОписаниеТипаСтрока(8));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ПрефиксНаименованияУпрощенногоОписанияОстатков,
		ОбщегоНазначения.ОписаниеТипаСтрока(15));

	//
	ДобавитьПараметризуемыеЭлементы(Результат, ПолеСпособВводаВОборот,
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП")); // СпособыВводаВОборотСУЗ в расширенной версии
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(АгрегацияЧерезГИСМТ);
	ПараметризуемыеЭлементы.Добавить(АгрегацияЧерезСУЗ);
	ПараметризуемыеЭлементы.Добавить(ВидыУпаковок);
	ПараметризуемыеЭлементы.Добавить(ДопустимыеВидыУпаковокВнутриЛогистическойУпаковки);
	ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.ВидыУпаковокИС"));
	
	// 
	Результат[ВидыУпаковок].ПоВсемВидамПродукции = Истина;
	Результат[ВидыУпаковок].ИспользоватьАтрибуты = Истина;
	АтрибутыВидовУпаковок = КонструкторИСОбщегоНазначенияКлиентСервер.АтрибутыВидовУпаковок();
	Для Каждого КлючИЗначение Из АтрибутыВидовУпаковок Цикл
		Результат[ВидыУпаковок].Атрибуты.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.ОписаниеТипа);
	КонецЦикла;
	Результат[ВидыУпаковок].Атрибуты.Вставить(
		"СокращенноеПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(МинимальнаяДлинаКодаЛогистическойУпаковки);
	ПараметризуемыеЭлементы.Добавить(МаксимальнаяДлинаКодаЛогистическойУпаковки);
	ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы,
		ОбщегоНазначения.ОписаниеТипаЧисло(3));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(ДопустимыеТипыШтрихкодовВнутриSSCC);
	ПараметризуемыеЭлементы.Добавить(ДопустимыеТипыШтрихкодовВнутриGS1);
	ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.ТипыШтрихкодов"),
		Тип("ПеречислениеСсылка.ВидыУпаковокИС"));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, КоэффициентПересчетаКоличестваЧастичногоВыбытияДляРазрешительногоРежима,
		ОбщегоНазначения.ОписаниеТипаЧисло(4, 3, ДопустимыйЗнак.Неотрицательный));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, СвязьЭлементаСправочникаИЗначенияПеречисленияВидаПродукции,
		Тип("ПеречислениеСсылка.ВидыПродукцииИС"));
	Результат[СвязьЭлементаСправочникаИЗначенияПеречисленияВидаПродукции].ПоВсемВидамПродукции = Истина;
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, ЧастичноеВыбытие,
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("ПеречислениеСсылка.ВидыДокументовЕГАИС"));
	
	//
	ДобавитьПараметризуемыеЭлементы(Результат, МераКоличестваПредметаРасчетаПриЧастичномВыбытии,
		Тип("ПеречислениеСсылка.МераКоличестваПредметаРасчетаККТ"));
	Результат[МераКоличестваПредметаРасчетаПриЧастичномВыбытии].КаждомуВидуПродукцииСоответствуетОдноЗначение = Истина;
	
	Результат[ВУПДПередаватьКодФИАСОтправителя].ИспользоватьАтрибуты = Истина;
	Результат[ВУПДПередаватьКодФИАСОтправителя].Атрибуты.Вставить(
		"ИндивидуальныйПредприниматель", Новый ОписаниеТипов("Булево"));
	Результат[ВУПДПередаватьКодФИАСОтправителя].Атрибуты.Вставить(
		"ЮридическоеЛицо", Новый ОписаниеТипов("Булево"));
	Результат[ВУПДПередаватьКодФИАСОтправителя].Атрибуты.Вставить(
		"ПоднадзорныйОбъектВЕТИС", Новый ОписаниеТипов("Булево"));
		
	Результат[ВУПДПередаватьКодФИАСПолучателя].ИспользоватьАтрибуты = Истина;
	Результат[ВУПДПередаватьКодФИАСПолучателя].Атрибуты.Вставить(
		"ИндивидуальныйПредприниматель", Новый ОписаниеТипов("Булево"));
	Результат[ВУПДПередаватьКодФИАСПолучателя].Атрибуты.Вставить(
		"ЮридическоеЛицо", Новый ОписаниеТипов("Булево"));
	Результат[ВУПДПередаватьКодФИАСПолучателя].Атрибуты.Вставить(
		"ПоднадзорныйОбъектВЕТИС", Новый ОписаниеТипов("Булево"));
	
	Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИС = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИС"); // - ОбщийМодуль.ИнтеграцияИС
		МодульИнтеграцияИС.ДополнитьПараметрыЭлементовКонструктора(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает предопределенные параметры элемента конструктора.
// 
// Параметры:
//   ЭлементКонструктора - СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС - элемент конструктора.
// 
// Возвращаемое значение:
//  см. НачальныеПараметрыЭлементаКонструктора
//
Функция ПараметрыЭлементаКонструктора(ЭлементКонструктора) Экспорт
	
	ПараметрыЭлементовКонструктора = ПараметрыЭлементовКонструктора();
	Параметры = ПараметрыЭлементовКонструктора[ЭлементКонструктора];
	Если Параметры = Неопределено Тогда
		Возврат НачальныеПараметрыЭлементаКонструктора();
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("ИмяПредопределенныхДанных");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает начальные параметры для элемента конструктора.
// 
// Возвращаемое значение:
//   Структура из КлючИЗначение:
//     * Ключ1     - Строка - Параметризуется.
//     * Значение1 - Булево - если Истина, тогда для вида продукции возможно указание значений.
//     * Ключ2     - Строка - ТипЗначения.
//     * Значение2 - ОписаниеТипов - типы используемого значения.
//     * Ключ3     - Строка - КаждомуВидуПродукцииСоответствуетОдноЗначение.
//     * Значение3 - Булево - если Истина, тогда для вида продукции возможно указание только одного значения.
//     * Ключ4     - Строка - ИспользоватьАтрибуты.
//     * Значение4 - Булево - если Истина, тогда доступно использование атрибутов.
//     * Ключ5     - Строка - Атрибуты.
//     * Значение5 - Структура из КлючИЗначение:
//         * Ключ     - Строка - имя атрибута.
//         * Значение - ОписаниеТипов - типы атрибута.
//
Функция НачальныеПараметрыЭлементаКонструктора()
	
	Результат = Новый Структура;
	Результат.Вставить("Параметризуется",      Ложь);
	Результат.Вставить("ТипЗначения",          Новый ОписаниеТипов("Неопределено"));
	Результат.Вставить("КаждомуВидуПродукцииСоответствуетОдноЗначение", Ложь);
	Результат.Вставить("ИспользоватьАтрибуты", Ложь);
	Результат.Вставить("Атрибуты",             Новый Структура);
	Результат.Вставить("ИзменяетсяВИнтерфейсеПользователя", Ложь);
	Результат.Вставить("ПоВсемВидамПродукции", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементыПоВсемВидамПродукции(ПараметрыЭлементовКонструктора)
	
	Результат = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПараметрыЭлементовКонструктора Цикл
		Если КлючИЗначение.Значение.ПоВсемВидамПродукции Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтандартныеЭлементы(Результат, СтандартныеЭлементы)
	
	Для Каждого Элемент Из СтандартныеЭлементы Цикл
		Результат.Вставить(Элемент, НачальныеПараметрыЭлементаКонструктора());
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДаты(Результат, Даты)
	
	Для Каждого ЭлементМассива Из Даты Цикл
		Результат.Вставить(ЭлементМассива, НачальныеПараметрыЭлементаКонструктора());
		Результат[ЭлементМассива].Параметризуется = Истина;
		Результат[ЭлементМассива].ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
		Результат[ЭлементМассива].КаждомуВидуПродукцииСоответствуетОдноЗначение = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы, ДоступныеТипы1, ДоступныеТипы2 = Неопределено, ДоступныеТипы3 = Неопределено, ДоступныеТипы4 = Неопределено) Экспорт

	Если ТипЗнч(ПараметризуемыеЭлементы) = Тип("Массив") Тогда
		Элементы = ПараметризуемыеЭлементы;
	Иначе
		Элементы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметризуемыеЭлементы);
	КонецЕсли;

	Типы = Новый Массив;

	Если ТипЗнч(ДоступныеТипы1) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, ДоступныеТипы1, Истина);
	Иначе
		Типы.Добавить(ДоступныеТипы1);
	КонецЕсли;

	Если ДоступныеТипы2 <> Неопределено Тогда
		Если ТипЗнч(ДоступныеТипы2) = Тип("Массив") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, ДоступныеТипы2, Истина);
		Иначе
			Типы.Добавить(ДоступныеТипы2);
		КонецЕсли;
	КонецЕсли;

	Если ДоступныеТипы3 <> Неопределено Тогда
		Если ТипЗнч(ДоступныеТипы3) = Тип("Массив") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, ДоступныеТипы3, Истина);
		Иначе
			Типы.Добавить(ДоступныеТипы3);
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступныеТипы4 <> Неопределено Тогда
		Если ТипЗнч(ДоступныеТипы4) = Тип("Массив") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, ДоступныеТипы4, Истина);
		Иначе
			Типы.Добавить(ДоступныеТипы4);
		КонецЕсли;
	КонецЕсли;
	
	Квалификаторы = Новый Структура("КвалификаторыДаты,КвалификаторыДвоичныхДанных,КвалификаторыСтроки,КвалификаторыЧисла");
	ВГраница = Типы.ВГраница();
	Для Счетчик = 0 По ВГраница Цикл
		Индекс = ВГраница - Счетчик;
		Тип = Типы[Индекс];
		Если ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
			Если Тип.СодержитТип(Тип("Дата")) Тогда
				Квалификаторы.КвалификаторыДаты = Тип.КвалификаторыДаты;
			КонецЕсли;
			Если Тип.СодержитТип(Тип("ДвоичныеДанные")) Тогда
				Квалификаторы.КвалификаторыДвоичныхДанных = Тип.КвалификаторыДвоичныхДанных;
			КонецЕсли;
			Если Тип.СодержитТип(Тип("Строка")) Тогда
				Квалификаторы.КвалификаторыСтроки = Тип.КвалификаторыСтроки;
			КонецЕсли;
			Если Тип.СодержитТип(Тип("Число")) Тогда
				Квалификаторы.КвалификаторыЧисла = Тип.КвалификаторыЧисла;
			КонецЕсли;
			Типы.Удалить(Индекс);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, Тип.Типы(), Истина);
		КонецЕсли;
	КонецЦикла;

	Для Каждого ПараметризуемыйЭлемент Из Элементы Цикл
		
		СуществующийЭлемент = Результат[ПараметризуемыйЭлемент];
		Если СуществующийЭлемент = Неопределено Тогда
			Результат.Вставить(ПараметризуемыйЭлемент, НачальныеПараметрыЭлементаКонструктора());
			Результат[ПараметризуемыйЭлемент].ТипЗначения = Новый ОписаниеТипов(Типы,
				Квалификаторы.КвалификаторыЧисла,
				Квалификаторы.КвалификаторыСтроки,
				Квалификаторы.КвалификаторыДаты,
				Квалификаторы.КвалификаторыДвоичныхДанных);
		Иначе
			КвалификаторыЧисла          = ?(Квалификаторы.КвалификаторыЧисла = Неопределено, СуществующийЭлемент.ТипЗначения.КвалификаторыЧисла, Квалификаторы.КвалификаторыЧисла);
			КвалификаторыСтроки         = ?(Квалификаторы.КвалификаторыСтроки = Неопределено, СуществующийЭлемент.ТипЗначения.КвалификаторыСтроки, Квалификаторы.КвалификаторыСтроки);
			КвалификаторыДаты           = ?(Квалификаторы.КвалификаторыДаты = Неопределено, СуществующийЭлемент.ТипЗначения.КвалификаторыДаты, Квалификаторы.КвалификаторыДаты);
			КвалификаторыДвоичныхДанных = ?(Квалификаторы.КвалификаторыДвоичныхДанных = Неопределено, СуществующийЭлемент.ТипЗначения.КвалификаторыДвоичныхДанных, Квалификаторы.КвалификаторыДвоичныхДанных);
			СуществующийЭлемент.ТипЗначения = Новый ОписаниеТипов(
				СуществующийЭлемент.ТипЗначения,
				Типы,,
				КвалификаторыЧисла,
				КвалификаторыСтроки,
				КвалификаторыДаты,
				КвалификаторыДвоичныхДанных);
		КонецЕсли;
		Результат[ПараметризуемыйЭлемент].Параметризуется = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
